FoodieGramapi/app/controllers/api/v1/comments_controller.rb

    def create
        comment = Comment.create!(comment_params)
---
INSERT INTO "comments" ("text", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "Hey this looks so good ^_^"], ["user_id", 9], ["post_id", 32], ["created_at", "2020-07-30 20:33:23.020317"], ["updated_at", "2020-07-30 20:33:23.020317"]]