FoodieGramapi/app/controllers/api/v1/likes_controller.rb

    def create
        like = Like.create!(like_params)
---
INSERT INTO "likes" ("user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 9], ["post_id", 5], ["created_at", "2020-07-30 14:24:16.188360"], ["updated_at", "2020-07-30 14:24:16.188360"]]