FoodieGramapi/app/controllers/api/v1/posts_controller.rb

    def show
        post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def create
        post = Post.create!(post_params)
---
INSERT INTO "posts" ("caption", "image_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"